<?
 function subistitue_letra($texto)
	{
			$trocarIsso = array('€','^','$','|','%','?','!','º','@','#','*','&','~','`',' ','à','á','â','ã','ä','å','ç','è','é','ê','ë','ì','í','î','ï','ñ','ò','ó','ô','õ','ö','ù','ü','ú','ÿ','À','Á','Â','Ã','Ä','Å','Ç','È','É','Ê','Ë','Ì','Í','Î','Ï','Ñ','Ò','Ó','Ô','Õ','Ö','O','Ù','Ü','Ú','Ÿ',);
			$porIsso = array('-','-','-','-','-','-','-','-','-','-','-','-','-','-','-','-','a','a','a','a','a','a','c','e','e','e','e','i','i','i','i','n','o','o','o','o','o','u','u','u','y','A','A','A','A','A','A','C','E','E','E','E','I','I','I','I','N','O','O','O','O','O','0','U','U','U','Y',);
			$titletext = str_replace($trocarIsso, $porIsso, $texto);
			return $titletext;
	}
	
function subistitue_letraa($texto)
	{
			$trocarIsso = array('€','^','$','|','%','?','!','º','@','#','*','&','~','`',' ','à','á','â','ã','ä','å','ç','è','é','ê','ë','ì','í','î','ï','ñ','ò','ó','ô','õ','ö','ù','ü','ú','ÿ','À','Á','Â','Ã','Ä','Å','Ç','È','É','Ê','Ë','Ì','Í','Î','Ï','Ñ','Ò','Ó','Ô','Õ','Ö','O','Ù','Ü','Ú','Ÿ',);
			$porIsso = array('-','-','-','-','-','-','-','-','-','-','-','-','-','-','-','-','a','a','a','a','a','a','c','e','e','e','e','i','i','i','i','n','o','o','o','o','o','u','u','u','y','A','A','A','A','A','A','C','E','E','E','E','I','I','I','I','N','O','O','O','O','O','0','U','U','U','Y',);
			$titletext = ereg_replace($trocarIsso, $porIsso, $texto);
			return $titletext;
	}

 ?>